# EnergyAnalysisDetailedModel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..EnergyAnalysisDetailedModel Property
GroupTypeId Class See Also
---
Detailed Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisDetailedModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisDetailedModel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisDetailedModel {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace